PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1615.inc
CRCXOR1          EQU  H'0001'
CRCXOR2          EQU  H'0002'
CRCXOR3          EQU  H'0003'
CRCXOR4          EQU  H'0004'
CRCXOR5          EQU  H'0005'
CRCXOR6          EQU  H'0006'
CRCXOR7          EQU  H'0007'


;----- CRCXORH Bits -----------------------------------------------------
XOR8             EQU  H'0000'
XOR9             EQU  H'0001'
XOR10            EQU  H'0002'
XOR11            EQU  H'0003'
XOR12            EQU  H'0004'
XOR13            EQU  H'0005'
XOR14            EQU  H'0006'
XOR15            EQU  H'0007'

CRCXOR8          EQU  H'0000'
CRCXOR9          EQU  H'0001'
CRCXOR10         EQU  H'0002'
CRCXOR11         EQU  H'0003'
CRCXOR12         EQU  H'0004'
CRCXOR13         EQU  H'0005'
CRCXOR14         EQU  H'0006'
CRCXOR15         EQU  H'0007'


;----- CRCCON0 Bits -----------------------------------------------------
FULL             EQU  H'0000'
SHIFTM           EQU  H'0001'
ACCM             EQU  H'0004'
BUSY_CRCCON0     EQU  H'0005'
CRCGO            EQU  H'0006'
EN               EQU  H'0007'

CRCFULL          EQU  H'0000'
CRCSHIFTM        EQU  H'0001'
CRCACCM          EQU  H'0004'
CRCBUSY          EQU  H'0005'
CRCEN            EQU  H'0007'


;----- CRCCON1 Bits -----------------------------------------------------
PLEN0            EQU  H'0000'
PLEN1            EQU  H'0001'
PLEN2            EQU  H'0002'
PLEN3            EQU  H'0003'
DLEN0            EQU  H'0004'
DLEN1            EQU  H'0005'
DLEN2            EQU  H'0006'
DLEN3            EQU  H'0007'


CRCPLEN0         EQU  H'0000'
CRCPLEN1         EQU  H'0001'
CRCPLEN2         EQU  H'0002'
CRCPLEN3         EQU  H'0003'
CRCDLEN0         EQU  H'0004'
CRCDLEN1         EQU  H'0005'
CRCDLEN2         EQU  H'0006'
CRCDLEN3         EQU  H'0007'


;----- AT1RESL Bits -----------------------------------------------------
AT1RES0          EQU  H'0000'
AT1RES1          EQU  H'0001'
AT1RES2          EQU  H'0002'
AT1RES3          EQU  H'0003'
AT1RES4          EQU  H'0004'
AT1RES5          EQU  H'0005'
AT1RES6          EQU  H'0006'
AT1RES7          EQU  H'0007'

RES0             EQU  H'0000'
RES1             EQU  H'0001'
RES2             EQU  H'0002'
RES3             EQU  H'0003'
RES4             EQU  H'0004'
RES5             EQU  H'0005'
RES6             EQU  H'0006'
RES7             EQU  H'0007'


;----- AT1RESH Bits -----------------------------------------------------
AT1RES8          EQU  H'0000'
AT1RES9          EQU  H'0001'

RES8             EQU  H'0000'
RES9             EQU  H'0001'


;----- AT1MISSL Bits -----------------------------------------------------
AT1MISS0         EQU  H'0000'
AT1MISS1         EQU  H'0001'
AT1MISS2         EQU  H'0002'
AT1MISS3         EQU  H'0003'
AT1MISS4         EQU  H'0004'
AT1MISS5         EQU  H'0005'
AT1MISS6         EQU  H'0006'
AT1MISS7         EQU  H'0007'

MISS0            EQU  H'0000'
MISS1            EQU  H'0001'
MISS2            EQU  H'0002'
MISS3            EQU  H'0003'
MISS4            EQU  H'0004'
MISS5            EQU  H'0005'
MISS6            EQU  H'0006'
MISS7            EQU  H'0007'


;----- AT1MISSH Bits -----------------------------------------------------
AT1MISS8         EQU  H'0000'
AT1MISS9         EQU  H'0001'
AT1MISS10        EQU  H'0002'
AT1MISS11        EQU  H'0003'
AT1MISS12        EQU  H'0004'
AT1MISS13        EQU  H'0005'
AT1MISS14        EQU  H'0006'
AT1MISS15        EQU  H'0007'

MISS8            EQU  H'0000'
MISS9            EQU  H'0001'
MISS10           EQU  H'0002'
MISS11           EQU  H'0003'
MISS12           EQU  H'0004'
MISS13           EQU  H'0005'
MISS14           EQU  H'0006'
MISS15           EQU  H'0007'


;----- AT1PERL Bits -----------------------------------------------------
AT1PER0          EQU  H'0000'
AT1PER1          EQU  H'0001'
AT1PER2          EQU  H'0002'
AT1PER3          EQU  H'0003'
AT1PER4          EQU  H'0004'
AT1PER5          EQU  H'0005'
AT1PER6          EQU  H'0006'
AT1PER7          EQU  H'0007'

PER0             EQU  H'0000'
PER1             EQU  H'0001'
PER2             EQU  H'0002'
PER3             EQU  H'0003'
PER4             EQU  H'0004'
PER5             EQU  H'0005'
PER6             EQU  H'0006'
PER7             EQU  H'0007'

PERL0            EQU  H'0000'
PERL1            EQU  H'0001'
PERL2            EQU  H'0002'
PERL3            EQU  H'0003'
PERL4            EQU  H'0004'
PERL5            EQU  H'0005'
PERL6            EQU  H'0006'
PERL7            EQU  H'0007'


;----- AT1PERH Bits -----------------------------------------------------
AT1PER8          EQU  H'0000'
AT1PER9          EQU  H'0001'
AT1PER10         EQU  H'0002'
AT1PER11         EQU  H'0003'
AT1PER12         EQU  H'0004'
AT1PER13         EQU  H'0005'
AT1PER14         EQU  H'0006'
AT1POV           EQU  H'0007'

PER8             EQU  H'0000'
PER9             EQU  H'0001'
PER10            EQU  H'0002'
PER11            EQU  H'0003'
PER12            EQU  H'0004'
PER13            EQU  H'0005'
PER14            EQU  H'0006'
PER15            EQU  H'0007'

PERH0            EQU  H'0000'
PERH1            EQU  H'0001'
PERH2            EQU  H'0002'
PERH3            EQU  H'0003'
PERH4            EQU  H'0004'
PERH5            EQU  H'0005'
PERH6            EQU  H'0006'
PERH7            EQU  H'0007'


;----- AT1PHSL Bits -----------------------------------------------------
AT1PHS0          EQU  H'0000'
AT1PHS1          EQU  H'0001'
AT1PHS2          EQU  H'0002'
AT1PHS3          EQU  H'0003'
AT1PHS4          EQU  H'0004'
AT1PHS5          EQU  H'0005'
AT1PHS6          EQU  H'0006'
AT1PHS7          EQU  H'0007'

PHS0             EQU  H'0000'
PHS1             EQU  H'0001'
PHS2             EQU  H'0002'
PHS3             EQU  H'0003'
PHS4             EQU  H'0004'
PHS5             EQU  H'0005'
PHS6             EQU  H'0006'
PHS7             EQU  H'0007'


;----- AT1PHSH Bits -----------------------------------------------------
AT1PHS8          EQU  H'0000'
AT1PHS9          EQU  H'0001'

PHS8             EQU  H'0000'
PHS9             EQU  H'0001'

PHSL8            EQU  H'0000'
PHSL9            EQU  H'0001'


