PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1615.inc
;----- AT1CON0 Bits -----------------------------------------------------
MODE             EQU  H'0000'
APMOD            EQU  H'0001'
POL_AT1CON0      EQU  H'0003'
PREC             EQU  H'0006'
EN               EQU  H'0007'

PS0_AT1CON0      EQU  H'0004'
PS1_AT1CON0      EQU  H'0005'

AT1MODE          EQU  H'0000'
AT1APMOD         EQU  H'0001'
AT1POL           EQU  H'0003'
AT1PREC          EQU  H'0006'
AT1EN            EQU  H'0007'

AT1PS0           EQU  H'0004'
AT1PS1           EQU  H'0005'


;----- AT1CON1 Bits -----------------------------------------------------
VALID            EQU  H'0000'
ACCS             EQU  H'0001'
MPP              EQU  H'0002'
PRP              EQU  H'0004'
PHP              EQU  H'0006'

AT1VALID         EQU  H'0000'
AT1ACCS          EQU  H'0001'
AT1MPP           EQU  H'0002'
AT1PRP           EQU  H'0004'
AT1PHP           EQU  H'0006'


;----- AT1IR0 Bits -----------------------------------------------------
AT1PERIF         EQU  H'0000'
AT1MISSIF        EQU  H'0001'
AT1PHSIF         EQU  H'0002'


;----- AT1IE0 Bits -----------------------------------------------------
AT1PERIE         EQU  H'0000'
AT1MISSIE        EQU  H'0001'
AT1PHSIE         EQU  H'0002'


;----- AT1IR1 Bits -----------------------------------------------------
AT1CC1IF         EQU  H'0000'
AT1CC2IF         EQU  H'0001'
AT1CC3IF         EQU  H'0002'


;----- AT1IE1 Bits -----------------------------------------------------
AT1CC1IE         EQU  H'0000'
AT1CC2IE         EQU  H'0001'
AT1CC3IE         EQU  H'0002'


;----- AT1STPTL Bits -----------------------------------------------------
AT1STPT0         EQU  H'0000'
AT1STPT1         EQU  H'0001'
AT1STPT2         EQU  H'0002'
AT1STPT3         EQU  H'0003'
AT1STPT4         EQU  H'0004'
AT1STPT5         EQU  H'0005'
AT1STPT6         EQU  H'0006'
AT1STPT7         EQU  H'0007'

STPT0            EQU  H'0000'
STPT1            EQU  H'0001'
STPT2            EQU  H'0002'
STPT3            EQU  H'0003'
STPT4            EQU  H'0004'
STPT5            EQU  H'0005'
STPT6            EQU  H'0006'
STPT7            EQU  H'0007'


;----- AT1STPTH Bits -----------------------------------------------------
AT1STPT8         EQU  H'0000'
AT1STPT9         EQU  H'0001'
AT1STPT10        EQU  H'0002'
AT1STPT11        EQU  H'0003'
AT1STPT12        EQU  H'0004'
AT1STPT13        EQU  H'0005'
AT1STPT14        EQU  H'0006'

STPT8            EQU  H'0000'
STPT9            EQU  H'0001'
STPT10           EQU  H'0002'
STPT11           EQU  H'0003'
STPT12           EQU  H'0004'
STPT13           EQU  H'0005'
STPT14           EQU  H'0006'


;----- AT1ERRL Bits -----------------------------------------------------
AT1ERR0          EQU  H'0000'
AT1ERR1          EQU  H'0001'
AT1ERR2          EQU  H'0002'
AT1ERR3          EQU  H'0003'
AT1ERR4          EQU  H'0004'
AT1ERR5          EQU  H'0005'
AT1ERR6          EQU  H'0006'
AT1ERR7          EQU  H'0007'

ERR0             EQU  H'0000'
ERR1             EQU  H'0001'
ERR2             EQU  H'0002'
ERR3             EQU  H'0003'
ERR4             EQU  H'0004'
ERR5             EQU  H'0005'
ERR6             EQU  H'0006'
ERR7             EQU  H'0007'

ERRL0            EQU  H'0000'
ERRL1            EQU  H'0001'
ERRL2            EQU  H'0002'
ERRL3            EQU  H'0003'
ERRL4            EQU  H'0004'
ERRL5            EQU  H'0005'
ERRL6            EQU  H'0006'
ERRL7            EQU  H'0007'


;----- AT1ERRH Bits -----------------------------------------------------
AT1ERR8          EQU  H'0000'
AT1ERR9          EQU  H'0001'
AT1ERR10         EQU  H'0002'
AT1ERR11         EQU  H'0003'
AT1ERR12         EQU  H'0004'
AT1ERR13         EQU  H'0005'
AT1ERR14         EQU  H'0006'
AT1ERR15         EQU  H'0007'

ERR8             EQU  H'0000'
ERR9             EQU  H'0001'
ERR10            EQU  H'0002'
ERR11            EQU  H'0003'
ERR12            EQU  H'0004'
ERR13            EQU  H'0005'
ERR14            EQU  H'0006'
ERR15            EQU  H'0007'

ERRH0            EQU  H'0000'
ERRH1            EQU  H'0001'
ERRH2            EQU  H'0002'
ERRH3            EQU  H'0003'
ERRH4            EQU  H'0004'
ERRH5            EQU  H'0005'
ERRH6            EQU  H'0006'
ERRH7            EQU  H'0007'


;----- AT1CLK Bits -----------------------------------------------------
CS               EQU  H'0000'

AT1CS            EQU  H'0000'

CS0              EQU  H'0000'

AT1CS0           EQU  H'0000'


;----- AT1SIG Bits -----------------------------------------------------
AT1SSEL0         EQU  H'0000'
AT1SSEL1         EQU  H'0001'
AT1SSEL2         EQU  H'0002'

SSEL0            EQU  H'0000'
SSEL1            EQU  H'0001'
SSEL2            EQU  H'0002'



;----- AT1CSEL1 Bits -----------------------------------------------------
AT1CP1S0         EQU  H'0000'
AT1CP1S1         EQU  H'0001'
AT1CP1S2         EQU  H'0002'

CP1S0            EQU  H'0000'
CP1S1            EQU  H'0001'
CP1S2            EQU  H'0002'



;----- AT1CC1L Bits -----------------------------------------------------
AT1CC10          EQU  H'0000'
AT1CC11          EQU  H'0001'
AT1CC12          EQU  H'0002'
AT1CC13          EQU  H'0003'
AT1CC14          EQU  H'0004'
AT1CC15          EQU  H'0005'
AT1CC16          EQU  H'0006'
AT1CC17          EQU  H'0007'

CC10             EQU  H'0000'
CC11             EQU  H'0001'
CC12             EQU  H'0002'
CC13             EQU  H'0003'
CC14             EQU  H'0004'
CC15             EQU  H'0005'
CC16             EQU  H'0006'
CC17             EQU  H'0007'


;----- AT1CC1H Bits -----------------------------------------------------
AT1CC18          EQU  H'0000'
AT1CC19          EQU  H'0001'

CC18             EQU  H'0000'
CC19             EQU  H'0001'


;----- AT1CCON1 Bits -----------------------------------------------------
AT1CC1MODE       EQU  H'0000'
AT1CAP1P         EQU  H'0003'
AT1CC1POL        EQU  H'0004'
AT1CC1EN         EQU  H'0007'

CC1MODE          EQU  H'0000'
CAP1P            EQU  H'0003'
CC1POL           EQU  H'0004'
CC1EN            EQU  H'0007'


;----- AT1CSEL2 Bits -----------------------------------------------------
AT1CP2S0         EQU  H'0000'
AT1CP2S1         EQU  H'0001'
AT1CP2S2         EQU  H'0002'


CP2S0            EQU  H'0000'
CP2S1            EQU  H'0001'
CP2S2            EQU  H'0002'


;----- AT1CC2L Bits -----------------------------------------------------
AT1CC20          EQU  H'0000'
AT1CC21          EQU  H'0001'
AT1CC22          EQU  H'0002'
AT1CC23          EQU  H'0003'
AT1CC24          EQU  H'0004'
AT1CC25          EQU  H'0005'
AT1CC26          EQU  H'0006'
AT1CC27          EQU  H'0007'

CC20             EQU  H'0000'
CC21             EQU  H'0001'
CC22             EQU  H'0002'
CC13             EQU  H'0003'
CC24             EQU  H'0004'
CCW5             EQU  H'0005'
CC26             EQU  H'0006'
CC27             EQU  H'0007'


;----- AT1CC2H Bits -----------------------------------------------------
AT1CC28          EQU  H'0000'
AT1CC29          EQU  H'0001'

CC28             EQU  H'0000'
CC29             EQU  H'0001'


