PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1615.inc
;----- SMT2CLK Bits -----------------------------------------------------
CSEL0            EQU  H'0000'
CSEL1            EQU  H'0001'
CSEL2            EQU  H'0002'


SMT2CSEL0        EQU  H'0000'
SMT2CSEL1        EQU  H'0001'
SMT2CSEL2        EQU  H'0002'


;----- SMT2SIG Bits -----------------------------------------------------
SSEL0            EQU  H'0000'
SSEL1            EQU  H'0001'
SSEL2            EQU  H'0002'
SSEL3            EQU  H'0003'
SSEL4            EQU  H'0004'


SMT2SSEL0        EQU  H'0000'
SMT2SSEL1        EQU  H'0001'
SMT2SSEL2        EQU  H'0002'
SMT2SSEL3        EQU  H'0003'
SMT2SSEL4        EQU  H'0004'


;----- SMT2WIN Bits -----------------------------------------------------
WSEL0            EQU  H'0000'
WSEL1            EQU  H'0001'
WSEL2            EQU  H'0002'
WSEL3            EQU  H'0003'
WSEL4            EQU  H'0004'


SMT2WSEL0        EQU  H'0000'
SMT2WSEL1        EQU  H'0001'
SMT2WSEL2        EQU  H'0002'
SMT2WSEL3        EQU  H'0003'
SMT2WSEL4        EQU  H'0004'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- INTPPS Bits -----------------------------------------------------
INTPPS0          EQU  H'0000'
INTPPS1          EQU  H'0001'
INTPPS2          EQU  H'0002'
INTPPS3          EQU  H'0003'
INTPPS4          EQU  H'0004'


;----- T0CKIPPS Bits -----------------------------------------------------
T0CKIPPS0        EQU  H'0000'
T0CKIPPS1        EQU  H'0001'
T0CKIPPS2        EQU  H'0002'
T0CKIPPS3        EQU  H'0003'
T0CKIPPS4        EQU  H'0004'


;----- T1CKIPPS Bits -----------------------------------------------------
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'


;----- T1GPPS Bits -----------------------------------------------------
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'


;----- CCP1PPS Bits -----------------------------------------------------
CCP1PPS0         EQU  H'0000'
CCP1PPS1         EQU  H'0001'
CCP1PPS2         EQU  H'0002'
CCP1PPS3         EQU  H'0003'
CCP1PPS4         EQU  H'0004'


;----- CCP2PPS Bits -----------------------------------------------------
CCP2PPS0         EQU  H'0000'
CCP2PPS1         EQU  H'0001'
CCP2PPS2         EQU  H'0002'
CCP2PPS3         EQU  H'0003'
CCP2PPS4         EQU  H'0004'


;----- ATINPPS Bits -----------------------------------------------------
ATINPPS0         EQU  H'0000'
ATINPPS1         EQU  H'0001'
ATINPPS2         EQU  H'0002'
ATINPPS3         EQU  H'0003'
ATINPPS4         EQU  H'0004'


;----- CWGINPPS Bits -----------------------------------------------------
CWGINPPS0        EQU  H'0000'
CWGINPPS1        EQU  H'0001'
CWGINPPS2        EQU  H'0002'
CWGINPPS3        EQU  H'0003'
CWGINPPS4        EQU  H'0004'


;----- T2PPS Bits -----------------------------------------------------
T2PPS0           EQU  H'0000'
T2PPS1           EQU  H'0001'
T2PPS2           EQU  H'0002'
T2PPS3           EQU  H'0003'
T2PPS4           EQU  H'0004'


;----- T3CKIPPS Bits -----------------------------------------------------
T3CKIPPS0        EQU  H'0000'
T3CKIPPS1        EQU  H'0001'
T3CKIPPS2        EQU  H'0002'
T3CKIPPS3        EQU  H'0003'
T3CKIPPS4        EQU  H'0004'


;----- T3GPPS Bits -----------------------------------------------------
T3GPPS0          EQU  H'0000'
T3GPPS1          EQU  H'0001'
T3GPPS2          EQU  H'0002'
T3GPPS3          EQU  H'0003'
T3GPPS4          EQU  H'0004'


;----- T4PPS Bits -----------------------------------------------------
T4PPS0           EQU  H'0000'
T4PPS1           EQU  H'0001'
T4PPS2           EQU  H'0002'
T4PPS3           EQU  H'0003'
T4PPS4           EQU  H'0004'


;----- T5CKIPPS Bits -----------------------------------------------------
T5CKIPPS0        EQU  H'0000'
T5CKIPPS1        EQU  H'0001'
T5CKIPPS2        EQU  H'0002'
T5CKIPPS3        EQU  H'0003'
T5CKIPPS4        EQU  H'0004'


;----- T5GPPS Bits -----------------------------------------------------
T5GPPS0          EQU  H'0000'
T5GPPS1          EQU  H'0001'
T5GPPS2          EQU  H'0002'
T5GPPS3          EQU  H'0003'
T5GPPS4          EQU  H'0004'


;----- T6PPS Bits -----------------------------------------------------
T6PPS0           EQU  H'0000'
T6PPS1           EQU  H'0001'
T6PPS2           EQU  H'0002'
T6PPS3           EQU  H'0003'
T6PPS4           EQU  H'0004'


;----- ATCC1PPS Bits -----------------------------------------------------
ATCC1PPS0        EQU  H'0000'
ATCC1PPS1        EQU  H'0001'
ATCC1PPS2        EQU  H'0002'
ATCC1PPS3        EQU  H'0003'
ATCC1PPS4        EQU  H'0004'


;----- SSPCLKPPS Bits -----------------------------------------------------
SSPCLKPPS0       EQU  H'0000'
SSPCLKPPS1       EQU  H'0001'
SSPCLKPPS2       EQU  H'0002'
SSPCLKPPS3       EQU  H'0003'
SSPCLKPPS4       EQU  H'0004'


;----- SSPDATPPS Bits -----------------------------------------------------
SSPDATPPS0       EQU  H'0000'
SSPDATPPS1       EQU  H'0001'
SSPDATPPS2       EQU  H'0002'
SSPDATPPS3       EQU  H'0003'
SSPDATPPS4       EQU  H'0004'


;----- SSPSSPPS Bits -----------------------------------------------------
SSPSSPPS0        EQU  H'0000'
SSPSSPPS1        EQU  H'0001'
SSPSSPPS2        EQU  H'0002'
SSPSSPPS3        EQU  H'0003'
SSPSSPPS4        EQU  H'0004'


;----- ATCC2PPS Bits -----------------------------------------------------
ATCC2PPS0        EQU  H'0000'
ATCC2PPS1        EQU  H'0001'
ATCC2PPS2        EQU  H'0002'
ATCC2PPS3        EQU  H'0003'
ATCC2PPS4        EQU  H'0004'


;----- RXPPS Bits -----------------------------------------------------
RXPPS0           EQU  H'0000'
RXPPS1           EQU  H'0001'
RXPPS2           EQU  H'0002'
RXPPS3           EQU  H'0003'
RXPPS4           EQU  H'0004'


;----- CKPPS Bits -----------------------------------------------------
CKPPS0           EQU  H'0000'
CKPPS1           EQU  H'0001'
CKPPS2           EQU  H'0002'
CKPPS3           EQU  H'0003'
CKPPS4           EQU  H'0004'


